app/Models/ModelKategori.php

    public function AllData()
    {
        return $this->db->table('tbl_kategori')
            ->orderBy('id_kategori', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kategori`
ORDER BY `id_kategori` DESC

    public function Add($data)
    {
        $this->db->table('tbl_kategori')->insert($data);
---
INSERT INTO `tbl_kategori` (`nama_kategori`) VALUES ('tes')